In [1]:
import pandas as pd
import numpy as np

In [2]:
# Cleaning Data
df = pd.read_csv("csv1.csv")

In [3]:
df.dtypes                                     # dtype of each col

id           int64
name        object
age        float64
country     object
gender      object
income     float64
dtype: object

In [5]:
df2 = df.fillna(0).copy()
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   0.0  Canada   Female  62000.0
3    3          Alex   0.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      0.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6             0  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0       0     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   0.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA        0  58000.0

In [7]:
df2["income"] = df2["income"].astype(int)   # change dtype from float to int
df2

    id          name   age country   gender  income
0    1      John Doe  29.0     USA     Male   55000
1    1      John Doe  29.0     USA     Male   55000
2    2    Jane Smith   0.0  Canada   Female   62000
3    3          Alex   0.0     USA  Unknown   47000
4    4  Maria Garcia  34.0   Spain   Female       0
5    5        Li Wei  27.0   China     Male   51000
6    6             0  45.0   India   Female   73000
7    7    Ahmed Khan  38.0       0     Male   68000
8    8    Rachel Lee  29.0     USA   Female   62000
9    9   Carlos Ruiz   0.0  Mexico     Male   45000
10  10   Emily Davis  31.0     USA        0   58000

# Handling String Types

In [8]:
# String type
df2["gender"].str.lower()                      # lower case
df2["gender"].str.upper()                      # upper case
df2["gender"].str.capitalize()                 # capitalize

0        Male
1        Male
2      Female
3     Unknown
4      Female
5        Male
6      Female
7        Male
8      Female
9        Male
10        NaN
Name: gender, dtype: object

In [19]:
type(df2["name"].str.split(" ")[0])

list

In [20]:
df2["name"].str.split(" ")   # splits into lists based on separator value

0         [John, Doe]
1         [John, Doe]
2       [Jane, Smith]
3              [Alex]
4     [Maria, Garcia]
5           [Li, Wei]
6                 NaN
7       [Ahmed, Khan]
8       [Rachel, Lee]
9      [Carlos, Ruiz]
10     [Emily, Davis]
Name: name, dtype: object

In [17]:
df2["country"].str.contains("US")

0      True
1      True
2     False
3      True
4     False
5     False
6     False
7       NaN
8      True
9     False
10     True
Name: country, dtype: object

In [18]:
df2["country"].str.contains("india", case=False)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7       NaN
8     False
9     False
10    False
Name: country, dtype: object